In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2013-01-01  1.145493 -0.162715 -0.576254  0.969348
2013-01-02  0.852390  0.541729  1.493321 -0.385396
2013-01-03 -0.018748  1.303999 -1.831004  0.921611
2013-01-04 -0.435295 -1.286835 -0.830205 -1.498952
2013-01-05  0.623439  0.021031 -0.572460 -0.402094
2013-01-06 -0.168323  1.001618 -0.806220 -2.632742

In [10]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df.head()

                   A         B         C         D
2013-01-01  1.145493 -0.162715 -0.576254  0.969348
2013-01-02  0.852390  0.541729  1.493321 -0.385396
2013-01-03 -0.018748  1.303999 -1.831004  0.921611
2013-01-04 -0.435295 -1.286835 -0.830205 -1.498952
2013-01-05  0.623439  0.021031 -0.572460 -0.402094

In [14]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.435295 -1.286835 -0.830205 -1.498952
2013-01-05  0.623439  0.021031 -0.572460 -0.402094
2013-01-06 -0.168323  1.001618 -0.806220 -2.632742

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.values

array([[ 1.14549252, -0.16271481, -0.57625397,  0.96934756],
       [ 0.85238997,  0.54172921,  1.49332146, -0.38539602],
       [-0.01874829,  1.30399928, -1.83100411,  0.92161072],
       [-0.43529484, -1.28683549, -0.8302053 , -1.49895222],
       [ 0.62343905,  0.02103107, -0.57245965, -0.40209448],
       [-0.16832281,  1.00161847, -0.8062203 , -2.6327421 ]])

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.333159  0.236471 -0.520470 -0.504704
std    0.629221  0.932146  1.091445  1.396355
min   -0.435295 -1.286835 -1.831004 -2.632742
25%   -0.130929 -0.116778 -0.824209 -1.224738
50%    0.302345  0.281380 -0.691237 -0.393745
75%    0.795152  0.886646 -0.573408  0.594859
max    1.145493  1.303999  1.493321  0.969348

In [19]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.145493    0.852390   -0.018748   -0.435295    0.623439   -0.168323
B   -0.162715    0.541729    1.303999   -1.286835    0.021031    1.001618
C   -0.576254    1.493321   -1.831004   -0.830205   -0.572460   -0.806220
D    0.969348   -0.385396    0.921611   -1.498952   -0.402094   -2.632742

In [20]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.969348 -0.576254 -0.162715  1.145493
2013-01-02 -0.385396  1.493321  0.541729  0.852390
2013-01-03  0.921611 -1.831004  1.303999 -0.018748
2013-01-04 -1.498952 -0.830205 -1.286835 -0.435295
2013-01-05 -0.402094 -0.572460  0.021031  0.623439
2013-01-06 -2.632742 -0.806220  1.001618 -0.168323

In [21]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -0.435295 -1.286835 -0.830205 -1.498952
2013-01-01  1.145493 -0.162715 -0.576254  0.969348
2013-01-05  0.623439  0.021031 -0.572460 -0.402094
2013-01-02  0.852390  0.541729  1.493321 -0.385396
2013-01-06 -0.168323  1.001618 -0.806220 -2.632742
2013-01-03 -0.018748  1.303999 -1.831004  0.921611

In [22]:
df['A']

2013-01-01    1.145493
2013-01-02    0.852390
2013-01-03   -0.018748
2013-01-04   -0.435295
2013-01-05    0.623439
2013-01-06   -0.168323
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  1.145493 -0.162715 -0.576254  0.969348
2013-01-02  0.852390  0.541729  1.493321 -0.385396
2013-01-03 -0.018748  1.303999 -1.831004  0.921611

In [24]:
df.loc[dates[0]]

A    1.145493
B   -0.162715
C   -0.576254
D    0.969348
Name: 2013-01-01 00:00:00, dtype: float64

In [25]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  1.145493 -0.162715
2013-01-02  0.852390  0.541729
2013-01-03 -0.018748  1.303999
2013-01-04 -0.435295 -1.286835
2013-01-05  0.623439  0.021031
2013-01-06 -0.168323  1.001618

In [27]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.852390  0.541729
2013-01-03 -0.018748  1.303999
2013-01-04 -0.435295 -1.286835

In [28]:
df.loc['20130102',['A','B']]

A    0.852390
B    0.541729
Name: 2013-01-02 00:00:00, dtype: float64

In [29]:
df.loc[dates[0],'A']

1.1454925199723256

In [30]:
df.at[dates[0],'A']

1.1454925199723256

In [31]:
df.iloc[3]

A   -0.435295
B   -1.286835
C   -0.830205
D   -1.498952
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.435295 -1.286835
2013-01-05  0.623439  0.021031

In [33]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.852390  1.493321
2013-01-03 -0.018748 -1.831004
2013-01-05  0.623439 -0.572460

In [34]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.852390  0.541729  1.493321 -0.385396
2013-01-03 -0.018748  1.303999 -1.831004  0.921611

In [35]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.162715 -0.576254
2013-01-02  0.541729  1.493321
2013-01-03  1.303999 -1.831004
2013-01-04 -1.286835 -0.830205
2013-01-05  0.021031 -0.572460
2013-01-06  1.001618 -0.806220

In [36]:
df.iloc[1,1]

0.5417292073409828

In [37]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.145493 -0.162715 -0.576254  0.969348
2013-01-02  0.852390  0.541729  1.493321 -0.385396
2013-01-05  0.623439  0.021031 -0.572460 -0.402094

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.145493       NaN       NaN  0.969348
2013-01-02  0.852390  0.541729  1.493321       NaN
2013-01-03       NaN  1.303999       NaN  0.921611
2013-01-04       NaN       NaN       NaN       NaN
2013-01-05  0.623439  0.021031       NaN       NaN
2013-01-06       NaN  1.001618       NaN       NaN

In [39]:
df2 = df.copy()

In [40]:
df2['E'] = ['one', 'one','two','three','four','three']

In [41]:
df2

                   A         B         C         D      E
2013-01-01  1.145493 -0.162715 -0.576254  0.969348    one
2013-01-02  0.852390  0.541729  1.493321 -0.385396    one
2013-01-03 -0.018748  1.303999 -1.831004  0.921611    two
2013-01-04 -0.435295 -1.286835 -0.830205 -1.498952  three
2013-01-05  0.623439  0.021031 -0.572460 -0.402094   four
2013-01-06 -0.168323  1.001618 -0.806220 -2.632742  three

In [42]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.018748  1.303999 -1.831004  0.921611   two
2013-01-05  0.623439  0.021031 -0.572460 -0.402094  four

In [43]:
s1 = pd.Series([1,2,3,4,5,6], index =
     pd.date_range('20130102', periods=6))

In [44]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [45]:
df['F'] = s1

In [46]:
df.at[dates[0],'A'] = 0

In [47]:
df.iat[0,1] = 0

In [48]:
df.loc[:,'D'] = np.array([5] * len(df))

In [49]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.576254  5  NaN
2013-01-02  0.852390  0.541729  1.493321  5  1.0
2013-01-03 -0.018748  1.303999 -1.831004  5  2.0
2013-01-04 -0.435295 -1.286835 -0.830205  5  3.0
2013-01-05  0.623439  0.021031 -0.572460  5  4.0
2013-01-06 -0.168323  1.001618 -0.806220  5  5.0

In [50]:
df2 = df.copy()

In [51]:
df2[df2 > 0] = -df2

In [52]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.576254 -5  NaN
2013-01-02 -0.852390 -0.541729 -1.493321 -5 -1.0
2013-01-03 -0.018748 -1.303999 -1.831004 -5 -2.0
2013-01-04 -0.435295 -1.286835 -0.830205 -5 -3.0
2013-01-05 -0.623439 -0.021031 -0.572460 -5 -4.0
2013-01-06 -0.168323 -1.001618 -0.806220 -5 -5.0

In [53]:
df.to_csv('foo.csv')

In [54]:
pd.read_csv('foo.csv')

   Unnamed: 0         A         B         C  D    F
0  2013-01-01  0.000000  0.000000 -0.576254  5  NaN
1  2013-01-02  0.852390  0.541729  1.493321  5  1.0
2  2013-01-03 -0.018748  1.303999 -1.831004  5  2.0
3  2013-01-04 -0.435295 -1.286835 -0.830205  5  3.0
4  2013-01-05  0.623439  0.021031 -0.572460  5  4.0
5  2013-01-06 -0.168323  1.001618 -0.806220  5  5.0

In [55]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [57]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [58]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.576254  5  NaN  1.0
2013-01-02  0.852390  0.541729  1.493321  5  1.0  1.0
2013-01-03 -0.018748  1.303999 -1.831004  5  2.0  NaN
2013-01-04 -0.435295 -1.286835 -0.830205  5  3.0  NaN

In [60]:
df1.dropna(how='any')

                  A         B         C  D    F    E
2013-01-02  0.85239  0.541729  1.493321  5  1.0  1.0

In [61]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.576254  5  5.0  1.0
2013-01-02  0.852390  0.541729  1.493321  5  1.0  1.0
2013-01-03 -0.018748  1.303999 -1.831004  5  2.0  5.0
2013-01-04 -0.435295 -1.286835 -0.830205  5  3.0  5.0

In [62]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [63]:
df.mean()

A    0.142244
B    0.263590
C   -0.520470
D    5.000000
F    3.000000
dtype: float64

In [64]:
df.mean(1)

2013-01-01    1.105937
2013-01-02    1.777488
2013-01-03    1.290849
2013-01-04    1.089533
2013-01-05    1.814402
2013-01-06    2.005415
Freq: D, dtype: float64

In [66]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [67]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [68]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.018748  0.303999 -2.831004  4.0  1.0
2013-01-04 -3.435295 -4.286835 -3.830205  2.0  0.0
2013-01-05 -4.376561 -4.978969 -5.572460  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [70]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.576254   5   NaN
2013-01-02  0.852390  0.541729  0.917067  10   1.0
2013-01-03  0.833642  1.845728 -0.913937  15   3.0
2013-01-04  0.398347  0.558893 -1.744142  20   6.0
2013-01-05  1.021786  0.579924 -2.316602  25  10.0
2013-01-06  0.853463  1.581543 -3.122822  30  15.0

In [71]:
df.apply(lambda x: x.max() - x.min())

A    1.287685
B    2.590835
C    3.324326
D    0.000000
F    4.000000
dtype: float64

In [72]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [73]:
s

0    3
1    1
2    2
3    3
4    5
5    5
6    4
7    5
8    4
9    1
dtype: int32

In [74]:
s.value_counts()

5    3
3    2
1    2
4    2
2    1
dtype: int64

In [75]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [76]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [78]:
df = pd.DataFrame(np.random.randn(10, 4))

In [79]:
df

          0         1         2         3
0 -1.725378  0.588819 -0.373198  1.441150
1 -1.660542 -1.422068 -0.825657  0.075241
2 -0.542226  0.248676  0.131708  1.064542
3  1.006516  0.265670 -0.195219 -1.513393
4  2.064467 -0.488007  0.354079  1.051175
5 -2.276896  1.684311 -0.158555  1.859914
6 -0.306210 -0.719100  0.268131  0.705477
7  0.689535 -1.109205 -0.369733 -1.018388
8 -1.336038 -1.770785  0.498441 -0.910526
9  0.478577  0.086698 -0.332276 -1.382209

In [82]:
pieces = [df[:3], df[3:7], df[:7]]

In [83]:
pd.concat(pieces)

          0         1         2         3
0 -1.725378  0.588819 -0.373198  1.441150
1 -1.660542 -1.422068 -0.825657  0.075241
2 -0.542226  0.248676  0.131708  1.064542
3  1.006516  0.265670 -0.195219 -1.513393
4  2.064467 -0.488007  0.354079  1.051175
5 -2.276896  1.684311 -0.158555  1.859914
6 -0.306210 -0.719100  0.268131  0.705477
0 -1.725378  0.588819 -0.373198  1.441150
1 -1.660542 -1.422068 -0.825657  0.075241
2 -0.542226  0.248676  0.131708  1.064542
3  1.006516  0.265670 -0.195219 -1.513393
4  2.064467 -0.488007  0.354079  1.051175
5 -2.276896  1.684311 -0.158555  1.859914
6 -0.306210 -0.719100  0.268131  0.705477

In [84]:
left = pd.DataFrame({'key':['foo', 'foo'], 'Ival':[1, 2]})

In [85]:
right = pd.DataFrame({'key':['foo', 'foo'], 'Ival':[4, 5]})

In [86]:
left

   key  Ival
0  foo     1
1  foo     2

In [87]:
right

   key  Ival
0  foo     4
1  foo     5

In [89]:
pd.merge(left, right, on='key')

   key  Ival_x  Ival_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

In [91]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A','B','C','D'])

In [92]:
df

          A         B         C         D
0  0.071841  0.361622  1.492313 -0.358231
1  1.331513  1.109740  0.715242  0.702568
2  0.227513  0.227033  0.303487  1.002214
3 -0.378446  1.571801 -0.346360  1.883862
4  0.020810  0.762833 -1.499330  0.309995
5 -0.913702 -0.414707 -1.782685  0.433167
6 -1.628354 -1.402191 -0.248820 -0.592608
7 -0.061578  1.704507 -1.285857 -0.047602

In [93]:
df.iloc[3]

A   -0.378446
B    1.571801
C   -0.346360
D    1.883862
Name: 3, dtype: float64

In [94]:
df.append(s, ignore_index=True)

C:\Users\ASUS\AppData\Local\Temp\ipykernel_6196\4011806271.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(s, ignore_index=True)

,A,B,C,D,0,1,2,3,4,5,6,7,8
0,0.071841,0.361622,1.492313,-0.358231,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.331513,1.109740,0.715242,0.702568,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,0.227513,0.227033,0.303487,1.002214,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,-0.378446,1.571801,-0.346360,1.883862,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,0.020810,0.762833,-1.499330,0.309995,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,-0.913702,-0.414707,-1.782685,0.433167,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,-1.628354,-1.402191,-0.248820,-0.592608,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,-0.061578,1.704507,-1.285857,-0.047602,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,A,B,C,Aaba,Baca,NaN,CABA,dog,cat

In [95]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'], 
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [96]:
df

     A      B         C         D
0  foo    one  0.203749  0.242652
1  bar    one  0.192697 -0.606482
2  foo    two  0.573264 -0.104267
3  bar  three -0.690895  0.295129
4  foo    two -0.894762  0.014532
5  bar    two -0.780405  0.525167
6  foo    one -1.048641 -0.233264
7  foo  three -0.108799  2.522159

In [97]:
df.groupby('A').sum()

            C         D
A
bar -1.278603  0.213814
foo -1.275190  2.441813

In [98]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.192697 -0.606482
    three -0.690895  0.295129
    two   -0.780405  0.525167
foo one   -0.844892  0.009388
    three -0.108799  2.522159
    two   -0.321498 -0.089735

In [99]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))

In [101]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [102]:
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=['A','B'])

In [103]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.576254 -5  NaN
2013-01-02 -0.852390 -0.541729 -1.493321 -5 -1.0
2013-01-03 -0.018748 -1.303999 -1.831004 -5 -2.0
2013-01-04 -0.435295 -1.286835 -0.830205 -5 -3.0
2013-01-05 -0.623439 -0.021031 -0.572460 -5 -4.0
2013-01-06 -0.168323 -1.001618 -0.806220 -5 -5.0

In [104]:
stacked = df2.stack()

In [105]:
stacked

2013-01-01  A    0.000000
            B    0.000000
            C   -0.576254
            D   -5.000000
2013-01-02  A   -0.852390
            B   -0.541729
            C   -1.493321
            D   -5.000000
            F   -1.000000
2013-01-03  A   -0.018748
            B   -1.303999
            C   -1.831004
            D   -5.000000
            F   -2.000000
2013-01-04  A   -0.435295
            B   -1.286835
            C   -0.830205
            D   -5.000000
            F   -3.000000
2013-01-05  A   -0.623439
            B   -0.021031
            C   -0.572460
            D   -5.000000
            F   -4.000000
2013-01-06  A   -0.168323
            B   -1.001618
            C   -0.806220
            D   -5.000000
            F   -5.000000
dtype: float64

In [106]:
stacked.unstack()

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.576254 -5.0  NaN
2013-01-02 -0.852390 -0.541729 -1.493321 -5.0 -1.0
2013-01-03 -0.018748 -1.303999 -1.831004 -5.0 -2.0
2013-01-04 -0.435295 -1.286835 -0.830205 -5.0 -3.0
2013-01-05 -0.623439 -0.021031 -0.572460 -5.0 -4.0
2013-01-06 -0.168323 -1.001618 -0.806220 -5.0 -5.0

In [107]:
stacked.unstack(1)

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.576254 -5.0  NaN
2013-01-02 -0.852390 -0.541729 -1.493321 -5.0 -1.0
2013-01-03 -0.018748 -1.303999 -1.831004 -5.0 -2.0
2013-01-04 -0.435295 -1.286835 -0.830205 -5.0 -3.0
2013-01-05 -0.623439 -0.021031 -0.572460 -5.0 -4.0
2013-01-06 -0.168323 -1.001618 -0.806220 -5.0 -5.0

In [108]:
stacked.unstack(0)

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.000000   -0.852390   -0.018748   -0.435295   -0.623439   -0.168323
B    0.000000   -0.541729   -1.303999   -1.286835   -0.021031   -1.001618
C   -0.576254   -1.493321   -1.831004   -0.830205   -0.572460   -0.806220
D   -5.000000   -5.000000   -5.000000   -5.000000   -5.000000   -5.000000
F         NaN   -1.000000   -2.000000   -3.000000   -4.000000   -5.000000

In [111]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [112]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [114]:
ts.resample('5Min').sum()

2012-01-01    24924
Freq: 5T, dtype: int32

In [116]:
ts = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [117]:
ts

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [118]:
ts_utc = ts.tz_localize('UTC')

In [119]:
ts_utc

DatetimeIndex(['2012-03-06 00:00:00+00:00', '2012-03-07 00:00:00+00:00',
               '2012-03-08 00:00:00+00:00', '2012-03-09 00:00:00+00:00',
               '2012-03-10 00:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='D')

In [120]:
ts_utc.tz_convert('US/Eastern')

DatetimeIndex(['2012-03-05 19:00:00-05:00', '2012-03-06 19:00:00-05:00',
               '2012-03-07 19:00:00-05:00', '2012-03-08 19:00:00-05:00',
               '2012-03-09 19:00:00-05:00'],
              dtype='datetime64[ns, US/Eastern]', freq='D')

In [121]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [122]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [123]:
ts

2012-01-31   -0.557368
2012-02-29   -0.072225
2012-03-31    0.997922
2012-04-30    1.093254
2012-05-31   -1.445675
Freq: M, dtype: float64

In [125]:
ps = ts.to_period()

In [126]:
ps

2012-01   -0.557368
2012-02   -0.072225
2012-03    0.997922
2012-04    1.093254
2012-05   -1.445675
Freq: M, dtype: float64

In [127]:
ps.to_timestamp()

2012-01-01   -0.557368
2012-02-01   -0.072225
2012-03-01    0.997922
2012-04-01    1.093254
2012-05-01   -1.445675
Freq: MS, dtype: float64

In [128]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [129]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [130]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [131]:
ts.head()

1990-03-01 09:00   -1.146858
1990-06-01 09:00   -0.824261
1990-09-01 09:00   -1.577034
1990-12-01 09:00    0.482261
1991-03-01 09:00   -0.799321
Freq: H, dtype: float64

In [134]:
df = pd.DataFrame({"id":[1,2,3,4,5,6],
    "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [136]:
df["grade"] = df["raw_grade"].astype("category")

In [137]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [138]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [143]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [144]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [145]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [ ]:
df.gro